{
  "banknotes": [
    {
      "id": "note_01",
      "name": "100 đồng",
      "sample_image": "Note1.jpg",
      "style_description": "Visual Sketching and Drawing Style\nThe style is a highly detailed and technical form of Intaglio Engraving\nLine Work & Texture (Hatching and Cross-Hatching):\nPrecision and Detail: Every component of the oil rig (beams, pipes, derricks, cranes) is rendered with meticulous fine lines. The clarity and sharpness of these lines are paramount for technical accuracy.\nTonal Variation: Shading and depth are created solely by the density and direction of hatching and cross-hatching. Darker areas  have tightly packed lines, while lighter, illuminated surfaces have sparser lines or appear almost white (paper tone).\n Material Suggestion: The parallel and intersecting lines effectively convey the metallic texture of the rigs and the dynamic, rippling surface of the water below.\nColor Style (Color Tone and Application)\nThe color style is duochromatic with warm and cool contrasting tones, primarily utilizing green and brown/sepia inks, typical of currency to denote different elements and add security features.\nPrimary Hues:\nCool Green/Teal: Predominantly used for the water and parts of the background, giving a sense of the sea. There are variations in the green, from a lighter, almost yellow-green in the upper right, to a deeper teal in the water directly under the rigs.\nWarm Brown/Sepia/Rust: Heavily applied to the main structures of the oil rigs and connecting platforms, providing a metallic, industrial, or even somewhat aged appearance.\nSubtle Yellow/Beige Background: The overall paper tone or a very light background print is a warm, faded yellow or beige, which allows the green and brown elements to stand out.\nColor Separation & Layering: The distinct separation of green for water/background and brown for the industrial structures indicates the use of multiple ink plates. This creates a clear visual distinction between natural elements (water) and man-made structures (rigs).\n Overall Effect: The combination of warm browns against cool greens creates a functional yet visually engaging contrast, highlighting the industrial subject against its marine environment. It's a pragmatic use of color for clarity and detail on a banknote.\n"
    },
    {
      "id": "note_02",
      "name": "5000 đồng",
      "sample_image": "Note2.jpg",
      "style_description": "Visual Sketching and Drawing Style\nThe style is an extremely precise and technical form of Line Engraving or Micro-printing, optimized for security and depicting complex machinery.\nLine Work & Texture (Hatching and Micro-patterns):\nTechnical Precision: The dominant characteristic is the absolute regularity and technical drawing precision. Unlike organic landscape engraving, the lines here are straight, parallel, and mathematically uniform to define the complex geometry.\nHatching for Form: Shading and three-dimensionality are created entirely by the density of thin, parallel lines (hatching).\nColor Style (Color Tone and Application)\nThe color style is duochromatic/tri-chromatic with a dominant theme of cool teal/green and muted yellow/beige, giving it a modern, industrialized, and marine atmosphere.\nPrimary Hues:\nTeal/Blue-Green: This color is primarily used for the drawing ink of the rigs and the water/sea surface. It's a deep, cool tone.\nMuted Yellow/Olive Green: This serves as the background and paper base, creating a subtle contrast and giving the whole image an aged or official look.\nBrown/Sepia Accents: Some lines or structures (like the supports or the walkway) may incorporate subtle warm brown tones, contrasting with the cool teal to add depth and detail, but the overall feeling is dominated by the cool tones.\nColor Application: The ink colors are finely printed over the pale background. The plain area is characterized by a mix of horizontal lines and fine dots/patterns in the teal color.\n"
    },
    {
      "id": "note_03",
      "name": "100000 đồng",
      "sample_image": "Note3.jpg",
      "style_description": "Visual Sketching and Drawing Style\nThe style is a highly detailed and representational form of Intaglio Engraving with precision.\nLine Work & Texture (Hatching and Cross-Hatching):\nFine Detail.\nTonal Variation: Shading, depth, and the illusion of three-dimensionality are built up solely through the density and direction of hatching and cross-hatching. Tightly packed lines create deep shadows, while sparser lines define lighter, illuminated surfaces or open areas.\nThe color style is predominantly monochromatic warm brown/sepia, giving it a historical, earthy, and serious tone.\nPrimary Hues:\nMonochromatic Brown/Sepia: The entire illustration is rendered in various shades of brown, ranging from lighter, faded tones to richer, deeper browns. This gives the image a unified, antique, and somewhat solemn aesthetic.\nSubtle Green Tint: There might be a very faint, almost imperceptible green tint in some background areas or along edges, suggesting a very subdued secondary color layer, but the brown dominates overwhelmingly.\nColor Application: The different shades of brown are achieved through the varying density of the line work, typical of single-color engraving\n"
    },
    {
      "id": "note_04",
      "name": "2 đồng",
      "sample_image": "Note4.jpg",
      "style_description": "Visual Sketching and Drawing Style\nThe style is a highly detailed and expressive form of Line Engraving (Intaglio), mastering the challenge of depicting complex organic textures.\nLine Work & Texture (Hatching and Cross-Hatching):\nMeticulous Detail: The illustration is built upon an extremely fine network of lines. All form, shading, and texture are rendered by the direction and density of hatching and cross-hatching.\nTextural Differentiation: Lines are expertly manipulated to suggest materials:\nTonal Variation: Shadows are achieved with densely packed cross-hatching, making the ink appear darker, while illuminated areas use very sparse lines or the white/beige of the paper.\nColor Style (Color Tone and Application)\nThe color style is duochromatic (two-color) with a harmonious cool-green/blue theme, creating an evocative maritime atmosphere.\nPrimary Hues:\nCool Green/Teal Ink: This is the dominant color of the engraving itself. It gives the image a fresh, antique-marine feeling.\nMuted Yellow/Beige/Off-White: This is the color of the paper or background print, providing a warm contrast to the cool green and giving the image an aged patina.\nColor Application: The cool green/teal ink is applied over the muted background. All variations in tone and shading are achieved using the green/teal ink through the density of the line work.\n"
    },
    {
      "id": "note_05",
      "name": "5 đồng",
      "sample_image": "Note5.jpg",
      "style_description": "visual style that is reminiscent of a historical engraving or a banknote illustration.\nHere is an extraction of the visual sketching and color style:\nVisual Sketching Style\nMedium & Texture: It strongly suggests a line engraving or etching, common for illustrations in books, documents, or currency from the 19th or early 20th century. The lines appear deliberate, precise, and cross-hatched for shading.\nDetail and Shading: Details are rendered using fine lines and cross-hatching (parallel, intersecting lines) to create depth, shadows, and texture.\nFigurative Representation: The figures are drawn in a realistic, almost academic style, emphasizing action and dramatic posture, which is characteristic of illustrations meant to commemorate an historical event.\nColor Style\nMonochromatic: The image is essentially monochromatic (using variations of a single color).\nColor Palette: The dominant hue is a muted shade of blue or indigo (often referred to as \"banknote blue,\" \"cyanotype blue,\" or \"engraving blue\"). This was a very common color choice for printing currency, official documents, and security engravings due to its historical association with stability and difficulty in counterfeiting compared to black ink on early presses.\nTonal Range: The limited tonal range is created by the density of the lines. Darker areas are achieved by more concentrated and cross-hatched lines, while lighter areas are represented by sparse lines or blank paper.\n"
    },
        {
          "id": "note_06",
          "name": "50 đồng",
          "sample_image": "Note6.jpg",
          "style_description": "Sketching/Drawing Style\nMedium/Look: The style strongly resembles a steel engraving or intaglio print, which is the classic method used for printing banknotes and official documents. This gives the image a high-security, official aesthetic.\nTechnique: It uses line work rather than broad shading. Details are created by:\nHatching and Cross-Hatching: Close parallel lines (hatching) and intersecting lines (cross-hatching) are used to create depth, shadow, and texture.\nContour Lines: Strong, clear lines define the edges of figures and objects, contributing to a sharp, detailed, and slightly stiff look.\nFine Detail: rendered with meticulous and repetitive fine lines.\nOverall Feel: The style is formal, highly detailed, and technical, reflecting the precision required for currency engraving.\nColor Style\nMonochromatic: The image is essentially monochromatic (single-color).\nHue: The dominant color is a shade of blue (often referred to as 'banknote blue' or an indigo/cobalt hue).\nTonal Range: The depth and contrast are created by varying the density of the blue lines against a lighter, slightly off-white or cream background, simulating the paper color. Shadows are darker blue/indigo where the lines are thickest, and highlights are the paper color where there are no lines.\nTexture/Aging: There is an overall yellowish/sepia-like tint or filter over the image, especially noticeable in the background and highlights, suggesting age, being photographed under specific lighting, or the original paper color.\n"
        }
      ]
    }
    